; ModuleID = '/tmp/llvm-7.0.0.src/lib/Target/X86/ropfuscator-extra/examples/src/example6.c'
source_filename = "/tmp/llvm-7.0.0.src/lib/Target/X86/ropfuscator-extra/examples/src/example6.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.emprec = type { i32, i8* }

$__llvm_profile_filename = comdat any

@.str = private unnamed_addr constant [18 x i8] c"Enter the choice\0A\00", align 1
@.str.1 = private unnamed_addr constant [55 x i8] c"1-Insert a new record into file\0A2-Display the records\0A\00", align 1
@.str.2 = private unnamed_addr constant [28 x i8] c"3-Update the record\0A4-Exit\0A\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.4 = private unnamed_addr constant [26 x i8] c"Enter the correct choice\0A\00", align 1
@.str.5 = private unnamed_addr constant [3 x i8] c"a+\00", align 1
@.str.6 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.7 = private unnamed_addr constant [23 x i8] c"Enter the employee id\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "count", scope: !2, file: !3, line: 19, type: !11, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.1 (tags/RELEASE_701/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !16)
!3 = !DIFile(filename: "/tmp/llvm-7.0.0.src/lib/Target/X86/ropfuscator-extra/examples/src/example6.c", directory: "/tmp/llvm-7.0.0.src/lib/Target/X86/ropfuscator-extra/examples/build/src")
!4 = !{}
!5 = !{!6, !13, !15}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "emp", file: !3, line: 14, baseType: !8)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "emprec", file: !3, line: 10, size: 128, elements: !9)
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "empid", scope: !8, file: !3, line: 11, baseType: !11, size: 32)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !8, file: !3, line: 12, baseType: !13, size: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !{!0}
!17 = !{i32 2, !"Dwarf Version", i32 4}
!18 = !{i32 2, !"Debug Info Version", i32 3}
!19 = !{i32 1, !"wchar_size", i32 4}
!20 = !{!"clang version 7.0.1 (tags/RELEASE_701/final)"}
!21 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 21, type: !22, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, unit: !2, retainedNodes: !4)
!22 = !DISubroutineType(types: !23)
!23 = !{null, !11, !24}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!25 = !DILocalVariable(name: "argc", arg: 1, scope: !21, file: !3, line: 21, type: !11)
!26 = !DILocation(line: 21, column: 15, scope: !21)
!27 = !DILocalVariable(name: "argv", arg: 2, scope: !21, file: !3, line: 21, type: !24)
!28 = !DILocation(line: 21, column: 27, scope: !21)
!29 = !DILocation(line: 21, column: 35, scope: !21)
!30 = !DILocalVariable(name: "choice", scope: !21, file: !3, line: 22, type: !11)
!31 = !DILocation(line: 22, column: 7, scope: !21)
!32 = !DILocation(line: 24, column: 3, scope: !21)
!33 = !DILocation(line: 25, column: 5, scope: !34)
!34 = distinct !DILexicalBlock(scope: !21, file: !3, line: 24, column: 13)
!35 = !DILocation(line: 26, column: 5, scope: !34)
!36 = !DILocation(line: 27, column: 5, scope: !34)
!37 = !DILocation(line: 28, column: 5, scope: !34)
!38 = !DILocation(line: 29, column: 13, scope: !34)
!39 = !DILocation(line: 29, column: 5, scope: !34)
!40 = !DILocation(line: 29, column: 21, scope: !34)
!41 = !DILocation(line: 31, column: 14, scope: !42)
!42 = distinct !DILexicalBlock(scope: !34, file: !3, line: 29, column: 21)
!43 = !DILocation(line: 31, column: 7, scope: !42)
!44 = !DILocation(line: 32, column: 7, scope: !42)
!45 = !DILocation(line: 34, column: 15, scope: !42)
!46 = !DILocation(line: 34, column: 7, scope: !42)
!47 = !DILocation(line: 35, column: 7, scope: !42)
!48 = !DILocation(line: 37, column: 14, scope: !42)
!49 = !DILocation(line: 37, column: 7, scope: !42)
!50 = !DILocation(line: 38, column: 7, scope: !42)
!51 = !DILocation(line: 40, column: 7, scope: !42)
!52 = !DILocation(line: 42, column: 7, scope: !42)
!53 = !DILocation(line: 43, column: 5, scope: !42)
!54 = distinct !{!54, !32, !55}
!55 = !DILocation(line: 44, column: 3, scope: !21)
!56 = !DILocation(line: 45, column: 1, scope: !21)
!57 = distinct !DISubprogram(name: "insert", scope: !3, file: !3, line: 48, type: !58, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, unit: !2, retainedNodes: !4)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !13}
!60 = !DILocalVariable(name: "a", arg: 1, scope: !57, file: !3, line: 48, type: !13)
!61 = !DILocation(line: 48, column: 19, scope: !57)
!62 = !DILocation(line: 48, column: 22, scope: !57)
!63 = !DILocalVariable(name: "fp1", scope: !57, file: !3, line: 49, type: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !66, line: 7, baseType: !67)
!66 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/tmp/llvm-7.0.0.src/lib/Target/X86/ropfuscator-extra/examples/build/src")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !69)
!68 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "/tmp/llvm-7.0.0.src/lib/Target/X86/ropfuscator-extra/examples/build/src")
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !85, !87, !88, !89, !93, !95, !97, !101, !104, !106, !109, !112, !113, !114, !118, !119}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !67, file: !68, line: 51, baseType: !11, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !67, file: !68, line: 54, baseType: !13, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !67, file: !68, line: 55, baseType: !13, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !67, file: !68, line: 56, baseType: !13, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !67, file: !68, line: 57, baseType: !13, size: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !67, file: !68, line: 58, baseType: !13, size: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !67, file: !68, line: 59, baseType: !13, size: 64, offset: 384)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !67, file: !68, line: 60, baseType: !13, size: 64, offset: 448)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !67, file: !68, line: 61, baseType: !13, size: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !67, file: !68, line: 64, baseType: !13, size: 64, offset: 576)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !67, file: !68, line: 65, baseType: !13, size: 64, offset: 640)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !67, file: !68, line: 66, baseType: !13, size: 64, offset: 704)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !67, file: !68, line: 68, baseType: !83, size: 64, offset: 768)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !68, line: 36, flags: DIFlagFwdDecl)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !67, file: !68, line: 70, baseType: !86, size: 64, offset: 832)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !67, file: !68, line: 72, baseType: !11, size: 32, offset: 896)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !67, file: !68, line: 73, baseType: !11, size: 32, offset: 928)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !67, file: !68, line: 74, baseType: !90, size: 64, offset: 960)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !91, line: 150, baseType: !92)
!91 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/tmp/llvm-7.0.0.src/lib/Target/X86/ropfuscator-extra/examples/build/src")
!92 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !67, file: !68, line: 77, baseType: !94, size: 16, offset: 1024)
!94 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !67, file: !68, line: 78, baseType: !96, size: 8, offset: 1040)
!96 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !67, file: !68, line: 79, baseType: !98, size: 8, offset: 1048)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 1)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !67, file: !68, line: 81, baseType: !102, size: 64, offset: 1088)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !68, line: 43, baseType: null)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !67, file: !68, line: 89, baseType: !105, size: 64, offset: 1152)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !91, line: 151, baseType: !92)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !67, file: !68, line: 91, baseType: !107, size: 64, offset: 1216)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !68, line: 37, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !67, file: !68, line: 92, baseType: !110, size: 64, offset: 1280)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !68, line: 38, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !67, file: !68, line: 93, baseType: !86, size: 64, offset: 1344)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !67, file: !68, line: 94, baseType: !15, size: 64, offset: 1408)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !67, file: !68, line: 95, baseType: !115, size: 64, offset: 1472)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !116, line: 62, baseType: !117)
!116 = !DIFile(filename: "/usr/lib64/llvm/7/bin/../../../../lib/clang/7.0.1/include/stddef.h", directory: "/tmp/llvm-7.0.0.src/lib/Target/X86/ropfuscator-extra/examples/build/src")
!117 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !67, file: !68, line: 96, baseType: !11, size: 32, offset: 1536)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !67, file: !68, line: 98, baseType: !120, size: 160, offset: 1568)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 160, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 20)
!123 = !DILocation(line: 49, column: 9, scope: !57)
!124 = !DILocalVariable(name: "temp1", scope: !57, file: !3, line: 50, type: !6)
!125 = !DILocation(line: 50, column: 8, scope: !57)
!126 = !DILocation(line: 50, column: 23, scope: !57)
!127 = !DILocation(line: 50, column: 16, scope: !57)
!128 = !DILocation(line: 52, column: 15, scope: !57)
!129 = !DILocation(line: 51, column: 3, scope: !57)
!130 = !DILocation(line: 51, column: 10, scope: !57)
!131 = !DILocation(line: 51, column: 15, scope: !57)
!132 = !DILocation(line: 54, column: 15, scope: !57)
!133 = !DILocation(line: 54, column: 9, scope: !57)
!134 = !DILocation(line: 54, column: 7, scope: !57)
!135 = !DILocation(line: 55, column: 7, scope: !136)
!136 = distinct !DILexicalBlock(scope: !57, file: !3, line: 55, column: 7)
!137 = !DILocation(line: 55, column: 11, scope: !136)
!138 = !DILocation(line: 55, column: 7, scope: !57)
!139 = !DILocation(line: 56, column: 5, scope: !136)
!140 = !DILocation(line: 58, column: 5, scope: !141)
!141 = distinct !DILexicalBlock(scope: !136, file: !3, line: 57, column: 8)
!142 = !DILocation(line: 59, column: 18, scope: !141)
!143 = !DILocation(line: 59, column: 25, scope: !141)
!144 = !DILocation(line: 59, column: 5, scope: !141)
!145 = !DILocation(line: 60, column: 13, scope: !141)
!146 = !DILocation(line: 60, column: 20, scope: !141)
!147 = !DILocation(line: 60, column: 12, scope: !141)
!148 = !DILocation(line: 60, column: 43, scope: !141)
!149 = !DILocation(line: 60, column: 5, scope: !141)
!150 = !DILocation(line: 61, column: 5, scope: !141)
!151 = !DILocation(line: 62, column: 23, scope: !141)
!152 = !DILocation(line: 62, column: 30, scope: !141)
!153 = !DILocation(line: 62, column: 5, scope: !141)
!154 = !DILocation(line: 63, column: 12, scope: !141)
!155 = !DILocation(line: 63, column: 19, scope: !141)
!156 = !DILocation(line: 63, column: 33, scope: !141)
!157 = !DILocation(line: 63, column: 5, scope: !141)
!158 = !DILocation(line: 64, column: 10, scope: !141)
!159 = !DILocation(line: 66, column: 10, scope: !57)
!160 = !DILocation(line: 66, column: 3, scope: !57)
!161 = !DILocation(line: 67, column: 8, scope: !57)
!162 = !DILocation(line: 67, column: 3, scope: !57)
!163 = !DILocation(line: 68, column: 8, scope: !57)
!164 = !DILocation(line: 68, column: 15, scope: !57)
!165 = !DILocation(line: 68, column: 3, scope: !57)
!166 = !DILocation(line: 69, column: 1, scope: !57)
!167 = distinct !DISubprogram(name: "display", scope: !3, file: !3, line: 72, type: !58, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false, unit: !2, retainedNodes: !4)
!168 = !DILocalVariable(name: "a", arg: 1, scope: !167, file: !3, line: 72, type: !13)
!169 = !DILocation(line: 72, column: 20, scope: !167)
!170 = !DILocation(line: 72, column: 23, scope: !167)
!171 = !DILocalVariable(name: "fp1", scope: !167, file: !3, line: 73, type: !64)
!172 = !DILocation(line: 73, column: 9, scope: !167)
!173 = !DILocalVariable(name: "ch", scope: !167, file: !3, line: 74, type: !14)
!174 = !DILocation(line: 74, column: 8, scope: !167)
!175 = !DILocalVariable(name: "var", scope: !167, file: !3, line: 75, type: !11)
!176 = !DILocation(line: 75, column: 7, scope: !167)
!177 = !DILocation(line: 75, column: 13, scope: !167)
!178 = !DILocalVariable(name: "temp", scope: !167, file: !3, line: 76, type: !6)
!179 = !DILocation(line: 76, column: 8, scope: !167)
!180 = !DILocation(line: 76, column: 22, scope: !167)
!181 = !DILocation(line: 76, column: 15, scope: !167)
!182 = !DILocation(line: 77, column: 24, scope: !167)
!183 = !DILocation(line: 77, column: 3, scope: !167)
!184 = !DILocation(line: 77, column: 9, scope: !167)
!185 = !DILocation(line: 77, column: 14, scope: !167)
